{
   "intents": [
      {
         "tag": "Fechas importantes",
         "patterns": [
            "¿Cuándo comienza el semestre académico?",
            "Dame las fechas clave del próximo trimestre.",
            "¿Cuándo son los exámenes finales?",
            "Necesito saber cuándo son las fechas de inscripción.",
            "¿Cuándo se publicarán los resultados de los exámenes?",
            "¿Cuándo son las vacaciones de invierno?",
            "Quiero información sobre los eventos deportivos de la universidad.",
            "¿Cuándo es la ceremonia de graduación de este año?",
            "¿Cuándo se celebran los eventos culturales en el campus?",
            "Dame un resumen de las fechas importantes del calendario académico.",
            "¿Cuándo son las fechas límite para entregar proyectos?",
            "¿Cuándo inicia el receso de primavera?",
            "¿Cuándo son las conferencias y seminarios académicos?",
            "¿Cuándo se llevan a cabo las ferias de empleo en el campus?",
            "¿Cuándo se celebran las semanas temáticas en la universidad?",
            "¿Cuándo son las fechas de inscripción para actividades extracurriculares?",
            "Quiero saber las fechas de los talleres y charlas de orientación.",
            "¿Cuándo se realizarán las elecciones estudiantiles?",
            "¿Cuándo son las fechas clave para los clubes estudiantiles?",
            "¿Cuándo comienzan las clases de idiomas extranjeros?",
            "Quiero saber fechas importantes",
            "Fechas",
            "Fechas importantes",
            "Fechas de asueto",
            "Fechas de examenes",
            "Fechas de pago",
            "Fechas limite",
            "Dame fechas importnates",
            "Tengo dudas sobre fechas",
            "Me gustaria saber algunas fechas",
            "Ayudame con unas fechas"
         ]
      },
      {
         "tag": "Materias disponibles",
         "patterns": [
            "¿Cuáles son las asignaturas de ciencias disponibles?",
            "Quiero información sobre las materias de humanidades.",
            "¿Hay asignaturas de informática en la oferta académica?",
            "¿Cuáles son las materias de arte que puedo elegir?",
            "¿Qué materias de matemáticas están disponibles este semestre?",
            "¿Cuáles son las opciones de cursos de historia?",
            "¿Puedes decirme qué asignaturas de psicología se ofrecen?",
            "Estoy interesado en las materias de negocios. ¿Cuáles están disponibles?",
            "¿Cuáles son las asignaturas de salud y medicina que puedo tomar?",
            "¿Qué materias de ingeniería están disponibles?",
            "¿Cuáles son las opciones de cursos de literatura?",
            "¿Puedes proporcionar una lista de las materias de ciencias sociales?",
            "Quiero saber cuáles son las asignaturas de educación disponibles.",
            "¿Cuáles son las materias de tecnología disponibles?",
            "¿Hay cursos de física en la oferta académica?",
            "¿Puedes darme información sobre las materias de química?",
            "¿Cuáles son las asignaturas de idiomas extranjeros?",
            "¿Qué cursos de economía se ofrecen?",
            "¿Cuáles son las opciones de cursos de música?",
            "¿Puedes mostrarme las materias de geografía disponibles?",
            "Quiero saber sobre las materias",
            "Materias",
            "Ayudame a saber sobre materias disponibles",
            "Me gustaria saber sobre materias",
            "Que materias hay",
            "con materias",
            "materias disponibles",
            "pregunta sobre materias",
            "duda de cursos",
            "curiosidad de asignaturas",
            "asignaturas",
            "cursos",
            "que materias hay para mi carrera",
            "que cursos hay de ingenieria",
            "que asignaturas hay de administracion",
            "cuantas materias hay en el semestre",
            "que opciones de materias tengo",
            "cuales maeterias puedo escoger",
            "que materias hay para contaduria",
            "cuales materias puedo meter",
            "cuales asignaturas puedo meter",
            "que cursos hay para meter"
         ]
      },
      {
         "tag": "Precios",
         "patterns": [
            "¿Cuál es el costo de la residencia estudiantil?",
            "Necesito información sobre las tasas de matrícula para estudiantes internacionales.",
            "¿Cuánto debo pagar por los libros de texto?",
            "¿Cuál es el costo del transporte público para estudiantes?",
            "¿Cuál es el precio de los materiales de laboratorio?",
            "¿Cuál es el costo de las comidas en el campus?",
            "Quiero saber cuánto cuesta el seguro de salud estudiantil.",
            "¿Cuál es el precio de la membresía en el gimnasio de la universidad?",
            "¿Cuánto debo pagar por el estacionamiento en el campus?",
            "¿Cuál es el costo de las cuotas de los clubes estudiantiles?",
            "¿Cuánto cuesta la inscripción en el programa de intercambio?",
            "Necesito información sobre las becas disponibles.",
            "¿Cuál es el costo de la residencia fuera del campus?",
            "¿Cuánto debo pagar por los exámenes de certificación?",
            "¿Cuál es el precio de las actividades extracurriculares?",
            "Quiero saber cuánto cuesta el acceso a la biblioteca.",
            "¿Cuál es el costo de las excursiones y viajes de estudio?",
            "¿Cuánto debo pagar por el acceso a laboratorios especializados?",
            "¿Cuál es el precio de las conferencias y eventos especiales?",
            "Necesito información sobre descuentos para estudiantes.",
            "precios",
            "quiero saber un precio",
            "cuanto cuesta la escuela",
            "que precio tiene una credencial",
            "cuanto cuesta sacar una credencial",
            "cuanto cuesta la titulacion",
            "que precio tiene la matricula",
            "cuando cuesta el semestre",
            "necesito saber precios",
            "cuanto cuesta sacar una constacia",
            "que precio tiene titularme",
            "dinero",
            "precios",
            "que precio cuesta la colegiatura",
            "cuanto tengo que pagar de colegiatura",
            "cuanto sale la escuela",
            "cuanto baro necesito"
         ]
      },
      {
         "tag": "Plan de estudios",
         "patterns": [
            "¿Cuáles son las materias obligatorias en el plan de estudios?",
            "¿Puedo personalizar mi plan de estudios?",
            "¿Cuáles son los requisitos de graduación?",
            "¿Cómo se distribuyen las asignaturas a lo largo de los años?",
            "Quiero saber más sobre las asignaturas de investigación.",
            "¿Cuáles son las opciones de especialización en el plan de estudios?",
            "¿Puedes proporcionar información sobre los cursos electivos?",
            "¿Cuáles son las materias que forman parte del núcleo común?",
            "¿Cuántos créditos se requieren para completar el plan de estudios?",
            "¿Cuáles son las materias que abordan habilidades de comunicación?",
            "¿Puedes decirme más sobre los proyectos finales de carrera?",
            "Quiero conocer las materias relacionadas con la ética y la moral.",
            "¿Cuáles son las materias que se centran en la resolución de problemas?",
            "¿Cuál es el enfoque del plan de estudios en investigación?",
            "¿Puedes proporcionar información sobre las pasantías académicas?",
            "Quiero saber cuáles son las materias relacionadas con la tecnología.",
            "¿Cuáles son las opciones de cursos de liderazgo?",
            "¿Puedes explicar cómo se estructuran las asignaturas en el plan de estudios?",
            "¿Qué materias están relacionadas con la sostenibilidad ambiental?",
            "¿Cuáles son las asignaturas que abordan temas culturales y sociales?",
            "Que materias tiene mi carrera",
            "Que cursos hay en mi carrera"
         ]
      },
      {
         "tag": "Horario",
         "patterns": [
            "¿Puedes ayudarme a crear un horario de clases para los lunes?",
            "Necesito un horario personalizado que se ajuste a mi trabajo a tiempo parcial.",
            "¿Puedes generarme un horario con espacios libres para estudiar?",
            "Quiero planificar mi horario académico de forma eficiente. ¿Puedes asistirme?",
            "¿Cómo puedo organizar mi horario de clases para las mañanas?",
            "¿Puedes mostrarme cómo distribuir las clases a lo largo de la semana?",
            "¿Puedes ayudarme a encontrar un equilibrio entre clases y actividades extracurriculares?",
            "Quiero un horario que me permita participar en un club deportivo.",
            "¿Puedes crear un horario que tenga bloques de estudio de 2 horas?",
            "¿Cuáles son los horarios de las clases de idiomas extranjeros?",
            "Necesito un horario que tenga tiempo para trabajar en proyectos grupales.",
            "¿Puedes ayudarme a planificar un horario de clases para los fines de semana?",
            "Quiero un horario que me permita asistir a clases nocturnas.",
            "ayudame con un horario",
            "necesito hacer un horario",
            "como hago mi horario",
            "ayudame a plenear horario",
            "horario",
            "necesito hacer un horario"
         ]
      }
   ]
}
